Repository: revenuemore/revenuemore-ios
Catalog: Sources/Resources/Localizable.xcstrings
Source language: en
Languages: tr

# error.bad_url.description
source: Bad URL.
tr: Hatalı adres.

# error.bad_url.reason
source: Bad or invalid URL was caught.
tr: Hatalı veya geçersiz adres.

# error.bad_url.recovery_suggestion
source: Please contact support@revenuemore.com
tr: Lütfen support@revenuemore.com ile iletişime geçin.

# error.fetch_entitlements.reason
source: There may be a problem with your RevenueMore account.
tr: RevenueMore hesabınızda bir sorun olabilir.

# error.fetch_entitlements.recovery_suggestion
source: Check error message and your RevenueMore dahsboard. If you can't find problem, please contact support@revenuemore.com
tr: Hata mesajını ve RevenueMore panonuzu kontrol edin. Sorunu bulamazsanız lütfen support@revenuemore.com ile iletişime geçin.

# error.fetch_paywalls.reason
source: This error triggered by our paywall service.
tr: Bu hata ödeme duvarı servisimiz tarafından tetiklendi.

# error.fetch_paywalls.recovery_suggestion
source: This error triggered by our paywall service. Please contact support@revenuemore.com
tr: Bu hata ödeme duvarı hizmetimiz tarafından tetiklendi. Lütfen support@revenuemore.com ile iletişime geçin

# error.fetch_product_failed.reason
source: When fetching products, an error occurred.
tr: Ürünler getirilirken bir hata oluştu.

# error.fetch_product_failed.recovery_suggestion
source: This error triggered by Apple. Please check product ids in offerings.
tr: Bu hata Apple tarafından tetiklendi. Lütfen tekliflerdeki ürün kimliklerini kontrol edin.

# error.invalid_receipt.description
source: Receipt data not found.
tr: Receipt data bulunamadı.

# error.invalid_receipt.reason
source: You may be working in a simulator.
tr: Simülatörde çalışıyor olabilirsiniz.

# error.invalid_receipt.recovery_suggestion
source: Try working with the physical device.
tr: Fiziksel cihaz ile çalışmayı deneyiniz.

# error.listen_payment_failed.reason
source: This error triggered by Apple. The user may have completed the payment process faliure.
tr: Bu hata Apple tarafından tetiklendi. Kullanıcı ödeme işlemini tamamlamış olabilir.

# error.listen_payment_failed.recovery_suggestion
source: You can check your Apple account or environment (Production/Sandbox).
tr: Apple hesabınızı veya ortamınızı (Üretim/Sandbox) kontrol edebilirsiniz.

# error.not_found_offering.description
source: No offerings were found.
tr: Hiçbir teklif bulunamadı.

# error.not_found_offering.reason
source: There isn't an offering in your RevenueMore account.
tr: RevenueMore hesabınızda bir teklif bulunmuyor.

# error.not_found_offering.recovery_suggestion
source: You need to add offering to your RevenueMore account.
tr: Teklifinizi RevenueMore hesabınıza eklemeniz gerekiyor.

# error.not_found_product_ids.description
source: No product identifiers were found.
tr: Ürün tanımlayıcısı bulunamadı.

# error.not_found_product_ids.reason
source: No product IDs were found in offerings.
tr: Tekliflerde ürün kimliği bulunamadı.

# error.not_found_product_ids.recovery_suggestion
source: Check your product ids in offerings.
tr: Tekliflerinizdeki ürün kimliklerini kontrol edin.

# error.not_found_product.description
source: No products were found.
tr: Ürün bulunamadı.

# error.not_found_product.reason
source: There isn't a product in your ReveneuMore account or Apple Store Connect account.
tr: ReveneuMore hesabınızda veya Apple Store Connect hesabınızda ürün bulunmamaktadır.

# error.not_found_product.recovery_suggestion
source: Check your products in your RevenueMore account or Apple Store Connect account. If you have added products, please let check your product IDs in your RevenueMore account.
tr: Ürünlerinizi RevenueMore hesabınızda veya Apple Store Connect hesabınızda kontrol edin. Ürün eklediyseniz lütfen RevenueMore hesabınızdaki ürün kimliklerinizi kontrol edin.

# error.not_found_store_product.description
source: No products were found.
tr: Ürün bulunamadı.

# error.not_found_store_product.reason
source: There isn't a store product in your Apple Store Connect account.
tr: Apple Store Connect hesabınızda mağaza ürünü bulunmuyor.

# error.not_found_store_product.recovery_suggestion
source: Check your products in your RevenueMore account or Apple Store Connect account.
tr: Ürünlerinizi RevenueMore hesabınızdan veya Apple Store Connect hesabınızdan kontrol edin.

# error.not_found_window_scene.description
source: Not found window scene.
tr: Pencere sahnesi bulunamadı.

# error.not_found_window_scene.reason
source: No window scene was found.
tr: Pencere sahnesi bulunamadı.

# error.not_found_window_scene.recovery_suggestion
source: This error caused in your App. Check need to check your window scene.
tr: Bu hata Uygulamanızda oluştu. Pencere sahnenizi kontrol etmeniz gerekiyor.

# error.not_initialized_store_kit_manager.reason
source: This error is caused by our developers.
tr: Bu hata geliştiricilerimizden kaynaklanmaktadır.

# error.not_initialized_store_kit_manager.recovery_suggestion
source: This error triggered by our sdk. Please contact support@revenuemore.com
tr: Bu hata sdk'mız tarafından tetiklendi. Lütfen support@revenuemore.com ile iletişime geçin.

# error.not_initialized_store_kit1_manager.description
source: StoreKit1 weren't initialized.
tr: StoreKit1 başlatılmadı.

# error.not_initialized_store_kit2_manager.description
source: StoreKit2 weren't initialized.
tr: StoreKit2 başlatılmadı.

# error.not_show_manage_subscriptions_without_message.description
source: Not shown manage subscriptions view.
tr: Abonelikleri yönetme görünümü gösterilmiyor.

# error.not_show_manage_subscriptions.reason
source: This error triggered by Apple. The sheet displays the customer’s currently active subscription for your app and the options to view, upgrade, downgrade, or cancel their subscription.
tr: Bu hata Apple tarafından tetiklendi. Sayfa, müşterinin uygulamanız için şu anda etkin olan aboneliğini ve aboneliklerini görüntüleme, yükseltme, düşürme veya iptal etme seçeneklerini görüntüler.

# error.not_show_manage_subscriptions.recovery_suggestion
source: You must have an active subscription.
tr: Aktif bir aboneliğiniz olması gerekmektedir.

# error.payment_completed_with_failure.reason
source: There may be a problem with your RevenueMore account.
tr: RevenueMore hesabınızda bir sorun olabilir.

# error.payment_completed_with_failure.recovery_suggestion
source: Check error message and your RevenueMore dahsboard. If you can't find problem, please contact support@revenuemore.com
tr: Hata mesajını ve RevenueMore panonuzu kontrol edin. Sorunu bulamazsanız lütfen support@revenuemore.com ile iletişime geçin

# error.purchase_canceled_by_user.description
source: User Cancelled.
tr: Kullanıcı İptal Etti.

# error.purchase_canceled_by_user.reason
source: User have canceled the payment process.
tr: Kullanıcı ödeme işlemini iptal etti.

# error.purchase_canceled_by_user.recovery_suggestion
source: User have canceled the payment process.
tr: Kullanıcı ödeme işlemini iptal etti.

# error.purchase_failed_without_message.reason
source: Failed to purchase the product.
tr: Ürün satın alınamadı.

# error.purchase_is_pending.description
source: Transaction waiting on SCA (Strong Customer Authentication) or approval from Ask to Buy.
tr: İşlem SCA (Güçlü Müşteri Kimlik Doğrulaması) veya Ask to Buy onayı bekliyor.

# error.purchase_is_pending.reason
source: Transaction waiting on SCA (Strong Customer Authentication) or approval from Ask to Buy
tr: İşlem SCA'da (Güçlü Müşteri Kimlik Doğrulaması) veya Satın Alma Talebi'nden onay bekliyor.

# error.purchase_is_pending.recovery_suggestion
source: The payment is pending. Maybe you have already purchased the subscription.
tr: Ödeme bekleniyor. Belki aboneliği zaten satın aldınız.

# error.purhase_failed_without_message.description
source: Failed to purchase the product.
tr: Ürün satın alınamadı.

# error.purhase_failed_without_message.recovery_suggestion
source: You can check your Apple account or environment (Production/Sandbox).
tr: Apple hesabınızı veya ortamınızı (Üretim/Sandbox) kontrol edebilirsiniz.

# error.restore_payment_failed.reason
source: This error triggered by Apple. The user may not have any active payments.
tr: Bu hata Apple tarafından tetiklendi. Kullanıcının aktif ödemesi olmayabilir.

# error.restore_payment_failed.recovery_suggestion
source: The user may not have any active payments. Firstly, user needs to purhase a subscription. You can check your Apple account or environment (Production/Sandbox).
tr: Kullanıcının aktif ödemeleri olmayabilir. Öncelikle kullanıcının bir abonelik satın alması gerekir. Apple hesabınızı veya ortamınızı (Üretim/Sandbox) kontrol edebilirsiniz.

# error.transaction_listener_unverified.description
source: Successful purchase but transaction/receipt can't be verified.
tr: Satın alma işlemi başarılı ancak işlem/fiş doğrulanamıyor.

# error.transaction_listener_unverified.reason
source: Could be a jailbroken phone.
tr: Jailbreak yapılmış bir telefon olabilir.

# error.transaction_listener_unverified.recovery_suggestion
source: Could be a jailbroken phone.
tr: Jailbreak yapılmış bir telefon olabilir.

# error.unexpected.description
source: Unexpected error occurred.
tr: Beklenmeyen bir hata oluştu.

# error.unexpected.reason
source: The reason is unknown.
tr: Nedeni bilinmiyor.

# error.unexpected.recovery_suggestion
source: The reason is unknown. Please contact support@revenuemore.com
tr: Nedeni bilinmiyor. Lütfen support@revenuemore.com ile iletişime geçin.

# not_initialize
source: RevenueMore weren't initialized. Please, firstly call RevenueMore.start()
tr: RevenueMore başlatılmadı. Lütfen öncelikle RevenueMore.start()'ı çağırın

# unit_test_mock
source: English
tr: Türkçe
